cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[6:4]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[7:7]</bitRange>
						
					</field>
					<field>
						<name>ABEOIntEn</name>
						<description>Enables the end of auto-baud interrupt.</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable end of auto-baud Interrupt.</name>
								<description>Disable end of auto-baud Interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable end of auto-baud Interrupt.</name>
								<description>Enable end of auto-baud Interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ABTOIntEn</name>
						<description>Enables the auto-baud time-out interrupt.</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable auto-baud time-out Interrupt.</name>
								<description>Disable auto-baud time-out Interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable auto-baud time-out Interrupt.</name>
								<description>Enable auto-baud time-out Interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>IIR</name>
				<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-only</access>
				<resetValue>0x01</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IntStatus</name>
						<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>At least one interrupt is pending.</name>
								<description>At least one interrupt is pending.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>No interrupt is pending.</name>
								<description>No interrupt is pending.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>IntId</name>
						<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART Rx FIFO. All other combinations of IER[3:1] not listed below are reserved (000, 100,101,111).</description>
						<bitRange>[3:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>1   - Receive Line Status (RLS).</name>
								<description>1   - Receive Line Status (RLS).</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2a - Receive Data Available (RDA).</name>
								<description>2a - Receive Data Available (RDA).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2b - Character Time-out Indicator (CTI).</name>
								<description>2b - Character Time-out Indicator (CTI).</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3   - THRE Interrupt.</name>
								<description>3   - THRE Interrupt.</description>
								<value>0x1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[5:4]</bitRange>
						
					</field>
					<field>
						<name>FIFOEnable</name>
						<description>These bits are equivalent to FCR[0].</description>
						<bitRange>[7:6]</bitRange>
						
					</field>
					<field>
						<name>ABEOInt</name>
						<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
						<bitRange>[8:8]</bitRange>
						
					</field>
					<field>
						<name>ABTOInt</name>
						<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
						<bitRange>[9:9]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>FCR</name>
				<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
				<alternateRegister>IIR</alternateRegister>
				<addressOffset>0x008</addressOffset>
				<access>write-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>FIFOEN</name>
						<description>FIFO Enable</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>UART FIFOs are disabled. Must not be used in the application.</name>
								<description>UART FIFOs are disabled. Must not be used in the application.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</name>
								<description>Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RXFIFORES</name>
						<description>RX FIFO Reset</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No impact on either of UART FIFOs.</name>
								<description>No impact on either of UART FIFOs.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</name>
								<description>Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>TXFIFORES</name>
						<description>TX FIFO Reset</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No impact on either of UART FIFOs.</name>
								<description>No impact on either of UART FIFOs.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</name>
								<description>Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[3:3]</bitRange>
						
