cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[5:4]</bitRange>
						
					</field>
					<field>
						<name>RXTL</name>
						<description>RX Trigger Level These two bits determine how many receiver UART FIFO characters must be written before an interrupt is activated.</description>
						<bitRange>[7:6]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Trigger level 0 (1 character or 0x01).</name>
								<description>Trigger level 0 (1 character or 0x01).</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Trigger level 1 (4 characters or 0x04).</name>
								<description>Trigger level 1 (4 characters or 0x04).</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Trigger level 2 (8 characters or 0x08).</name>
								<description>Trigger level 2 (8 characters or 0x08).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Trigger level 3 (14 characters or 0x0E).</name>
								<description>Trigger level 3 (14 characters or 0x0E).</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>LCR</name>
				<description>Line Control Register. Contains controls for frame formatting and break generation.</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WLS</name>
						<description>Word Length Select</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>5-bit character length.</name>
								<description>5-bit character length.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>6-bit character length.</name>
								<description>6-bit character length.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>7-bit character length.</name>
								<description>7-bit character length.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>8-bit character length.</name>
								<description>8-bit character length.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SBS</name>
						<description>Stop Bit Select</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>1 stop bit.</name>
								<description>1 stop bit.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2 stop bits (1.5 if LCR[1:0]=00).</name>
								<description>2 stop bits (1.5 if LCR[1:0]=00).</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PE</name>
						<description>Parity Enable</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable parity generation and checking.</name>
								<description>Disable parity generation and checking.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable parity generation and checking.</name>
								<description>Enable parity generation and checking.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PS</name>
						<description>Parity Select</description>
						<bitRange>[5:4]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</name>
								<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</name>
								<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Forced 1 stick parity.</name>
								<description>Forced 1 stick parity.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Forced 0 stick parity.</name>
								<description>Forced 0 stick parity.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>BC</name>
						<description>Break Control</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable break transmission.</name>
								<description>Disable break transmission.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</name>
								<description>Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>DLAB</name>
						<description>Divisor Latch Access Bit (DLAB)</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable access to Divisor Latches.</name>
								<description>Disable access to Divisor Latches.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable access to Divisor Latches.</name>
								<description>Enable access to Divisor Latches.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
						
