cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>SCR</name>
				<description>Scratch Pad Register. Eight-bit temporary storage for software.</description>
				<addressOffset>0x01C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Pad</name>
						<description>A readable, writable byte.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ACR</name>
				<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Start</name>
						<description>This bit is automatically cleared after auto-baud completion.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Auto-baud stop (auto-baud is not running).</name>
								<description>Auto-baud stop (auto-baud is not running).</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</name>
								<description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>Mode</name>
						<description>Auto-baud mode select bit.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Mode 0.</name>
								<description>Mode 0.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Mode 1.</name>
								<description>Mode 1.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>AutoRestart</name>
						<description>Restart select.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No restart</name>
								<description>No restart</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Restart in case of time-out (counter restarts at next UART Rx falling edge)</name>
								<description>Restart in case of time-out (counter restarts at next UART Rx falling edge)</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[7:3]</bitRange>
						
					</field>
					<field>
						<name>ABEOIntClr</name>
						<description>End of auto-baud interrupt clear bit (write only accessible).</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Writing a 0 has no impact.</name>
								<description>Writing a 0 has no impact.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Writing a 1 will clear the corresponding interrupt in the IIR.</name>
								<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ABTOIntClr</name>
						<description>Auto-baud time-out interrupt clear bit (write only accessible).</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Writing a 0 has no impact.</name>
								<description>Writing a 0 has no impact.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Writing a 1 will clear the corresponding interrupt in the IIR.</name>
								<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>FDR</name>
				<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x10</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIVADDVAL</name>
						<description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the UART baud rate.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MULVAL</name>
						<description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for UART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>TER</name>
				<description>Transmit Enable Register. Turns off UART transmitter for use with software flow control.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x80</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[6:0]</bitRange>
					</field>
					<field>
						<name>TXEN</name>
						<description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>RS485CTRL</name>
				<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>
				<addressOffset>0x04C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>NMMEN</name>
						<description>RS-485/EIA-485 mode</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</name>
								<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the UART to set the parity error and generate an interrupt.</name>
								<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the UART to set the parity error and generate an interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RXDIS</name>
						<description>Receiver enable/disable</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>The receiver is enabled.</name>
								<description>The receiver is enabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>The receiver is disabled.</name>
								<description>The receiver is disabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>AADEN</name>
						<description>Auto Address Detect (AAD) enable/disable</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Auto Address Detect (AAD) is disabled.</name>
								<description>Auto Address Detect (AAD) is disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Auto Address Detect (AAD) is enabled.</name>
								<description>Auto Address Detect (AAD) is enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:3]</bitRange>
						
