cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
		</registers>
	</peripheral>

	<peripheral>
		<name>PMU</name>
		<description>Product name title=UM10429 Chapter title=LPC1102 PMU (PowerManagement Unit) Modification date=11/1/2010 Major revision=1 Minor revision=not available </description>
		<groupName>PMU</groupName>
		<baseAddress>0x40038000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
			<register>
				<name>PCON</name>
				<description>Power control register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. This bit must always be written as 0.</description>
						<bitRange>[0:0]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.  This bit must always be written as 0.</description>
						<bitRange>[1:1]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits must always be written as 0.</description>
						<bitRange>[7:2]</bitRange>
						
					</field>
					<field>
						<name>SLEEPFLAG</name>
						<description>Sleep mode flag</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Read: No power-down mode entered. LPC1102 is in Active mode. Write: No effect.</name>
								<description>Read: No power-down mode entered. LPC1102 is in Active mode. Write: No effect.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Read: Sleep/Deep-sleepmode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</name>
								<description>Read: Sleep/Deep-sleepmode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.  These bits must always be written as 0.</description>
						<bitRange>[10:9]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. This bit must always be written as 0.</description>
						<bitRange>[11:11]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[31:12]</bitRange>
						
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>
  	<peripheral>
  		<name>FLASHCTRL</name>
  		<description>Product name title=UM10462 Chapter title=LPC11U1x Flash programming firmware Modification date=3/17/2011 Major revision=0 Minor revision=3 </description>
  		<groupName>FLASHCTRL</groupName>
  		<baseAddress>0x4003C000</baseAddress>
  		<addressBlock>
  			<offset>0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>FMC</name>
  			<value>27</value>
  		</interrupt>
  		<registers>
  			<register>
  				<name>FLASHCFG</name>
  				<description>Flash memory access time configuration register</description>
  				<addressOffset>0x010</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>FLASHTIM</name>
  						<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
  						<bitRange>[1:0]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>1_SYSTEM_CLOCK_FLASH</name>
  								<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
  								<value>0x1</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>2_SYSTEM_CLOCKS_FLAS</name>
  								<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
  								<value>0x2</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>3_SYSTEM_CLOCKS_FLAS</name>
  								<description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>
  								<value>0x3</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>
  						<bitRange>[31:2]</bitRange>
  						
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSSTART</name>
  				<description>Signature start address register</description>
  				<addressOffset>0x020</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>START</name>
  						<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>
  						<bitRange>[16:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[31:17]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSSTOP</name>
  				<description>Signature stop-address register</description>
  				<addressOffset>0x024</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>STOP</name>
  						<description>BIST stop address divided by 16 (corresponds to AHB byte address [20:4]).</description>
  						<bitRange>[16:0]</bitRange>
  						
