cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
					<field>
						<name>ADMODE</name>
						<description>Selects Analog/Digital mode</description>
						<bitRange>[7:7]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>ANALOG_INPUT_MODE</name>
								<description>Analog input mode</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>DIGITAL_FUNCTIONAL_M</name>
								<description>Digital functional mode</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[9:8]</bitRange>
						
						
					</field>
					<field>
						<name>OD</name>
						<description>Selects pseudo open-drain mode.</description>
						<bitRange>[10:10]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>STANDARD_GPIO_OUTPUT</name>
								<description>Standard GPIO output</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>OPEN_DRAIN_OUTPUT</name>
								<description>Open-drain output</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:11]</bitRange>
						
						
					</field>
				</fields>
			</register>
			<register>
				<name>PIO1_6</name>
				<description>I/O configuration for pin PIO1_6/RXD/CT32B0_MAT0</description>
				<addressOffset>0x0A4</addressOffset>
				<access>read-write</access>
				<resetValue>0xD0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>FUNC</name>
						<description>Selects pin function. All other values are reserved.</description>
						<bitRange>[2:0]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>SELECTS_FUNCTION_PIO</name>
								<description>Selects function PIO1_6.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SELECTS_FUNCTION_RXD</name>
								<description>Selects function RXD.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SELECTS_FUNCTION_CT3</name>
								<description>Selects function CT32B0_MAT0.</description>
								<value>0x2</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>MODE</name>
						<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
						<bitRange>[4:3]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>INACTIVE_NO_PULL_DO</name>
								<description>Inactive (no pull-down/pull-up resistor enabled).</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PULL_DOWN_RESISTOR_E</name>
								<description>Pull-down resistor enabled.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PULL_UP_RESISTOR_ENA</name>
								<description>Pull-up resistor enabled.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>REPEATER_MODE_</name>
								<description>Repeater mode.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>HYS</name>
						<description>Hysteresis.</description>
						<bitRange>[5:5]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>DISABLE_</name>
								<description>Disable.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE_</name>
								<description>Enable.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[9:6]</bitRange>
						
						
					</field>
					<field>
						<name>OD</name>
						<description>Selects pseudo open-drain mode. See Section 7.1 for part specific details.</description>
						<bitRange>[10:10]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>STANDARD_GPIO_OUTPUT</name>
								<description>Standard GPIO output</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>OPEN_DRAIN_OUTPUT</name>
								<description>Open-drain output</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:11]</bitRange>
						
						
					</field>
				</fields>
			</register>
			<register>
				<name>PIO1_7</name>
				<description>I/O configuration for pin PIO1_7/TXD/CT32B0_MAT1</description>
				<addressOffset>0x0A8</addressOffset>
				<access>read-write</access>
				<resetValue>0xD0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>FUNC</name>
						<description>Selects pin function. All other values are reserved.</description>
						<bitRange>[2:0]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>SELECTS_FUNCTION_PIO</name>
								<description>Selects function PIO1_7.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SELECTS_FUNCTION_TXD</name>
								<description>Selects function TXD.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SELECTS_FUNCTION_CT3</name>
								<description>Selects function CT32B0_MAT1.</description>
								<value>0x2</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>MODE</name>
						<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
						<bitRange>[4:3]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>INACTIVE_NO_PULL_DO</name>
								<description>Inactive (no pull-down/pull-up resistor enabled).</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PULL_DOWN_RESISTOR_E</name>
								<description>Pull-down resistor enabled.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PULL_UP_RESISTOR_ENA</name>
								<description>Pull-up resistor enabled.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>REPEATER_MODE_</name>
								<description>Repeater mode.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>HYS</name>
						<description>Hysteresis.</description>
						<bitRange>[5:5]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>DISABLE_</name>
								<description>Disable.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE_</name>
								<description>Enable.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[9:6]</bitRange>
						
						
