cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
					<field>
						<name>OD</name>
						<description>Selects pseudo open-drain mode. See Section 7.1 for part specific details.</description>
						<bitRange>[10:10]</bitRange>
						
						<enumeratedValues>
							<name>ENUM</name>
							
							<enumeratedValue>
								<name>STANDARD_GPIO_OUTPUT</name>
								<description>Standard GPIO output</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>OPEN_DRAIN_OUTPUT</name>
								<description>Open-drain output</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:11]</bitRange>
						
						
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>

	<peripheral>
		<name>SYSCON</name>
		<description>Product name title=UM10429 Chapter title=LPC1102 System configuration Modification date=11/1/2010 Major revision=1 Minor revision=not available </description>
		<groupName>SYSCON</groupName>
		<baseAddress>0x40048000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>BOD</name>
			<value>26</value>
		</interrupt>
		<interrupt>
			<name>PIO0_0</name>
			<value>0</value>
		</interrupt>

		
		<interrupt>
			<name>PIO0_8</name>
			<value>8</value>
		</interrupt>
		<interrupt>
			<name>PIO0_9</name>
			<value>9</value>
		</interrupt>
		<interrupt>
			<name>PIO0_10</name>
			<value>10</value>
		</interrupt>
		<interrupt>
			<name>PIO0_11</name>
			<value>11</value>
		</interrupt>
		<interrupt>
			<name>PIO1_0</name>
			<value>12</value>
		</interrupt>
		<registers>
			<register>
				<name>SYSMEMREMAP</name>
				<description>System memory remap</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x002</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MAP</name>
						<description>System memory remap</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</name>
								<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</name>
								<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</name>
								<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</name>
								<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>PRESETCTRL</name>
				<description>Peripheral reset control</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SSP0_RST_N</name>
						<description>SPI0 reset control</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Resets the SPI0 peripheral.</name>
								<description>Resets the SPI0 peripheral.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SPI0 reset de-asserted.</name>
								<description>SPI0 reset de-asserted.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SYSPLLCTRL</name>
				<description>System PLL control</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MSEL</name>
						<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ration M = 32</description>
						<bitRange>[4:0]</bitRange>
						
					</field>
					<field>
						<name>PSEL</name>
						<description>Post divider ratio P. The division ratio is 2 x P.</description>
						<bitRange>[6:5]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>P = 1</name>
								<description>P = 1</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>P = 2</name>
								<description>P = 2</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>P = 4</name>
								<description>P = 4</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>P = 8</name>
								<description>P = 8</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to reserved bits.</description>
						<bitRange>[31:7]</bitRange>
						
