cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>SYSPLLSTAT</name>
				<description>System PLL status</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-only</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>LOCK</name>
						<description>PLL lock status</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>PLL not locked</name>
								<description>PLL not locked</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PLL locked</name>
								<description>PLL locked</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SYSOSCCTRL</name>
				<description>System oscillator control</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>BYPASS</name>
						<description>Bypass system oscillator</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Oscillator is not bypassed.</name>
								<description>Oscillator is not bypassed.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin.</name>
								<description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FREQRANGE</name>
						<description>Determines frequency range for Low-power oscillator.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>1 - 20 MHz frequency range.</name>
								<description>1 - 20 MHz frequency range.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>15 - 25 MHz frequency range</name>
								<description>15 - 25 MHz frequency range</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>WDTOSCCTRL</name>
				<description>Watchdog oscillator control</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIVSEL</name>
						<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
						<bitRange>[4:0]</bitRange>
						
					</field>
					<field>
						<name>FREQSEL</name>
						<description>Select watchdog oscillator analog output frequency (Fclkana).</description>
						<bitRange>[8:5]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>0.5 MHz</name>
								<description>0.5 MHz</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>0.8 MHz</name>
								<description>0.8 MHz</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>1.1 MHz</name>
								<description>1.1 MHz</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>1.4 MHz</name>
								<description>1.4 MHz</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>1.6 MHz</name>
								<description>1.6 MHz</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>1.8 MHz</name>
								<description>1.8 MHz</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.0 MHz</name>
								<description>2.0 MHz</description>
								<value>0x7</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.2 MHz</name>
								<description>2.2 MHz</description>
								<value>0x8</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.4 MHz</name>
								<description>2.4 MHz</description>
								<value>0x9</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.6 MHz</name>
								<description>2.6 MHz</description>
								<value>0xA</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.7 MHz</name>
								<description>2.7 MHz</description>
								<value>0xB</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>2.9 MHz</name>
								<description>2.9 MHz</description>
								<value>0xC</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3.1 MHz</name>
								<description>3.1 MHz</description>
								<value>0xD</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3.2 MHz</name>
								<description>3.2 MHz</description>
								<value>0xE</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3.4 MHz</name>
								<description>3.4 MHz</description>
								<value>0xF</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:9]</bitRange>
						
