cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>IRCCTRL</name>
				<description>IRC control</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x080</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>TRIM</name>
						<description>Trim value</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:9]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SYSRSTSTAT</name>
				<description>System reset status register</description>
				<addressOffset>0x030</addressOffset>
				<access>read-only</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>POR</name>
						<description>POR reset status</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>no POR detected</name>
								<description>no POR detected</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>POR detected</name>
								<description>POR detected</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>EXTRST</name>
						<description>RESET pin status</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>no RESET event detected</name>
								<description>no RESET event detected</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESET detected</name>
								<description>RESET detected</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDT</name>
						<description>Status of the Watchdog reset</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>no WDT reset detected</name>
								<description>no WDT reset detected</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>WDT reset detected</name>
								<description>WDT reset detected</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>BOD</name>
						<description>Status of the Brown-out detect reset</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>no BOD reset detected</name>
								<description>no BOD reset detected</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD reset detected</name>
								<description>BOD reset detected</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SYSRST</name>
						<description>Status of the software system reset</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>no System reset detected</name>
								<description>no System reset detected</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>System reset detected</name>
								<description>System reset detected</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:5]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SYSPLLCLKSEL</name>
				<description>System PLL clock source select</description>
				<addressOffset>0x040</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SEL</name>
						<description>System PLL clock source</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>IRC oscillator</name>
								<description>IRC oscillator</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>System oscillator</name>
								<description>System oscillator</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Reserved</name>
								<description>Reserved</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Reserved</name>
								<description>Reserved</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SYSPLLCLKUEN</name>
				<description>System PLL clock source update enable</description>
				<addressOffset>0x044</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ENA</name>
						<description>Enable system PLL clock source update</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No change</name>
								<description>No change</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Update clock source</name>
								<description>Update clock source</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:1]</bitRange>
						
