cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>MAINCLKSEL</name>
				<description>Main clock source select</description>
				<addressOffset>0x070</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SEL</name>
						<description>Clock source for main clock</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>IRC oscillator</name>
								<description>IRC oscillator</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Input clock to system PLL</name>
								<description>Input clock to system PLL</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>WDT oscillator</name>
								<description>WDT oscillator</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>System PLL clock out</name>
								<description>System PLL clock out</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>MAINCLKUEN</name>
				<description>Main clock source update enable</description>
				<addressOffset>0x074</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ENA</name>
						<description>Enable main clock source update</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No change</name>
								<description>No change</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Update clock source</name>
								<description>Update clock source</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SYSAHBCLKDIV</name>
				<description>System AHB clock divider</description>
				<addressOffset>0x078</addressOffset>
				<access>read-write</access>
				<resetValue>0x001</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIV</name>
						<description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SYSAHBCLKCTRL</name>
				<description>System AHB clock control</description>
				<addressOffset>0x080</addressOffset>
				<access>read-write</access>
				<resetValue>0x85F</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SYS</name>
						<description>Enables clock for AHB to APB bridge, to the AHB matrix, to the Cortex-M0 FCLK and HCLK, to the SysCon, and to the PMU. This bit is read only.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Reserved</name>
								<description>Reserved</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ROM</name>
						<description>Enables clock for ROM.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RAM</name>
						<description>Enables clock for RAM.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FLASHREG</name>
						<description>Enables clock for flash register interface.</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disabled</name>
								<description>Disabled</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enabled</name>
								<description>Enabled</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FLASHARRAY</name>
						<description>Enables clock for flash array access.</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disabled</name>
								<description>Disabled</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enabled</name>
								<description>Enabled</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[5:5]</bitRange>
						
