cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
					<field>
						<name>GPIO</name>
						<description>Enables clock for GPIO.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CT16B0</name>
						<description>Enables clock for 16-bit counter/timer 0.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CT16B1</name>
						<description>Enables clock for 16-bit counter/timer 1.</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CT32B0</name>
						<description>Enables clock for 32-bit counter/timer 0.</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CT32B1</name>
						<description>Enables clock for 32-bit counter/timer 1.</description>
						<bitRange>[10:10]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SSP0</name>
						<description>Enables clock for SPI0.</description>
						<bitRange>[11:11]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>UART</name>
						<description>Enables clock for UART. Note that the UART pins must be configured in the IOCON block before the UART clock can be enabled.</description>
						<bitRange>[12:12]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ADC</name>
						<description>Enables clock for ADC.</description>
						<bitRange>[13:13]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[14:14]</bitRange>
						
					</field>
					<field>
						<name>WDT</name>
						<description>Enables clock for WDT.</description>
						<bitRange>[15:15]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>IOCON</name>
						<description>Enables clock for I/O configuration block.</description>
						<bitRange>[16:16]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable</name>
								<description>Disable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable</name>
								<description>Enable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:17]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>SSP0CLKDIV</name>
				<description>SPI0 clock divder</description>
				<addressOffset>0x094</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIV</name>
						<description>SPI0_PCLK clock divider values 0: Disable SPI0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>UARTCLKDIV</name>
				<description>UART clock divder</description>
				<addressOffset>0x098</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIV</name>
						<description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>WDTCLKSEL</name>
				<description>WDT clock source select</description>
				<addressOffset>0x0D0</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SEL</name>
						<description>WDT clock source</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>IRC oscillator</name>
								<description>IRC oscillator</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Main clock</name>
								<description>Main clock</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Watchdog oscillator</name>
								<description>Watchdog oscillator</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Reserved</name>
								<description>Reserved</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
