cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>WDTCLKUEN</name>
				<description>WDT clock source update enable</description>
				<addressOffset>0x0D4</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ENA</name>
						<description>Enable WDT clock source update</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No change</name>
								<description>No change</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Update clock source</name>
								<description>Update clock source</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>WDTCLKDIV</name>
				<description>WDT clock divider</description>
				<addressOffset>0x0D8</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIV</name>
						<description>WDT clock divider values 0: Disable WDT_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>PIOPORCAP0</name>
				<description>POR captured PIO status 0</description>
				<addressOffset>0x100</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0x00000000</resetMask>
				<fields>
					<field>
						<name>CAPPIO0_0</name>
						<description>Raw reset status input PIO0_0</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[7:1]</bitRange>
					</field>
					<field>
						<name>CAPPIO0_8</name>
						<description>Raw reset status input PIO0_8</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CAPPIO0_9</name>
						<description>Raw reset status input PIO0_9</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CAPPIO0_10</name>
						<description>Raw reset status input PIO0_10</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CAPPIO0_11</name>
						<description>Raw reset status input PIO0_11</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_0</name>
						<description>Raw reset status input PIO1_0</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_1</name>
						<description>Raw reset status input PIO1_1</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_2</name>
						<description>Raw reset status input PIO1_2</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_3</name>
						<description>Raw reset status input PIO1_3</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[17:16]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_6</name>
						<description>Raw reset status input PIO1_6</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CAPPIO1_7</name>
						<description>Raw reset status input PIO1_7</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:20]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>BODCTRL</name>
				<description>BOD control</description>
				<addressOffset>0x150</addressOffset>
				<access>read-write</access>
				<resetValue>0x000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>BODRSTLEV</name>
						<description>BOD reset level</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V.</name>
								<description>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 1: The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V.</name>
								<description>Level 1: The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 2: The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V.</name>
								<description>Level 2: The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 3: The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V.</name>
								<description>Level 3: The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>BODINTVAL</name>
						<description>BOD interrupt level</description>
						<bitRange>[3:2]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Level 0: The interrupt assertion threshold voltage is 1.65 V; the interrupt de-assertion threshold voltage is 1.80 V.</name>
								<description>Level 0: The interrupt assertion threshold voltage is 1.65 V; the interrupt de-assertion threshold voltage is 1.80 V.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 1:The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V.</name>
								<description>Level 1:The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 2: The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V.</name>
								<description>Level 2: The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Level 3: The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V.</name>
								<description>Level 3: The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>BODRSTENA</name>
						<description>BOD reset enable</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>Disable reset function.</name>
								<description>Disable reset function.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Enable reset function.</name>
								<description>Enable reset function.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:5]</bitRange>
						
