cmsis-svd/cmsis-svd/data/NXP/LPC1102.svd
					</field>
				</fields>
			</register>
			<register>
				<name>STARTRSRP0CLR</name>
				<description>Start logic reset register 0</description>
				<addressOffset>0x208</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0x00000000</resetMask>
				<fields>
					<field>
						<name>RSRPIO0_0</name>
						<description>Start signal reset for start logic input PIO0_0</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[7:1]</bitRange>
						
					</field>
					<field>
						<name>RSRPIO0_8</name>
						<description>Start signal reset for start logic input PIO0_8</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RSRPIO0_9</name>
						<description>Start signal reset for start logic input PIO0_9</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RSRPIO0_10</name>
						<description>Start signal reset for start logic input PIO0_10</description>
						<bitRange>[10:10]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RSRPIO0_11</name>
						<description>Start signal reset for start logic input PIO0_11</description>
						<bitRange>[11:11]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RSRPIO1_0</name>
						<description>Start signal reset for start logic input PIO1_0</description>
						<bitRange>[12:12]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>RESERVED</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Write: reset start signal</name>
								<description>Write: reset start signal</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:13]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>STARTSRP0</name>
				<description>Start logic status register 0</description>
				<addressOffset>0x20C</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0x00000000</resetMask>
				<fields>
					<field>
						<name>SRPIO0_0</name>
						<description>Start signal status for start logic input 0PIO0_0</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[7:1]</bitRange>
						
					</field>
					<field>
						<name>SRPIO0_8</name>
						<description>Start signal status for start logic input PIO0_8</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SRPIO0_9</name>
						<description>Start signal status for start logic input PIO0_9</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SRPIO0_10</name>
						<description>Start signal status for start logic input PIO0_10</description>
						<bitRange>[10:10]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SRPIO0_11</name>
						<description>Start signal status for start logic input PIO0_11</description>
						<bitRange>[11:11]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SRPIO1_0</name>
						<description>Start signal status for start logic input PIO1_0</description>
						<bitRange>[12:12]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>No start signal received</name>
								<description>No start signal received</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>Start signal pending</name>
								<description>Start signal pending</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:13]</bitRange>
						
